Can't paste Labels across Families of different Categories.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotPasteLabelsAcrossFamilies { get; }
  Visual Basic
Public Shared ReadOnly Property CannotPasteLabelsAcrossFamilies As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotPasteLabelsAcrossFamilies {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FamilyFailures Class
  Autodesk.Revit.DB Namespace